__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 512, 512, 32) 0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 256, 256, 16) 4624        input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 256, 256, 16) 64          conv2d_1[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 256, 256, 16) 0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 256, 256, 16) 2320        leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 256, 256, 16) 64          conv2d_2[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 256, 256, 16) 0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 128, 128, 32) 4640        leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 128, 128, 32) 128         conv2d_4[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 128, 128, 32) 0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 128, 128, 32) 9248        leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 128, 128, 32) 128         conv2d_5[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 128, 128, 32) 0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 64, 64, 64)   18496       leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 64, 64, 64)   256         conv2d_7[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 64, 64, 64)   0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 64, 64, 64)   36928       leaky_re_lu_7[0][0]              
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 64, 64, 64)   256         conv2d_8[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 64, 64, 64)   0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 32, 32, 128)  73856       leaky_re_lu_8[0][0]              
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 32, 32, 128)  512         conv2d_10[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, 32, 32, 128)  0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 32, 32, 128)  147584      leaky_re_lu_10[0][0]             
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 32, 32, 128)  512         conv2d_11[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 32, 32, 128)  0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 32, 32, 4)    516         leaky_re_lu_11[0][0]             
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 32, 32, 4)    16          conv2d_13[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 32, 32, 4)    0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 32, 32, 4)    16          leaky_re_lu_13[0][0]             
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 32, 32, 128)  4736        batch_normalization_14[0][0]     
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 32, 32, 128)  512         conv2d_14[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)      (None, 32, 32, 128)  0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 32, 32, 128)  16512       leaky_re_lu_14[0][0]             
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 32, 32, 128)  512         conv2d_15[0][0]                  
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 64, 64, 4)    260         leaky_re_lu_8[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)      (None, 32, 32, 128)  0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 64, 64, 4)    16          conv2d_9[0][0]                   
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 64, 64, 128)  0           leaky_re_lu_15[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 64, 64, 4)    0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 64, 64, 132)  0           lambda_1[0][0]                   
                                                                 leaky_re_lu_9[0][0]              
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 64, 64, 132)  528         concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 64, 64, 128)  152192      batch_normalization_17[0][0]     
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 64, 64, 128)  512         conv2d_16[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)      (None, 64, 64, 128)  0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 64, 64, 128)  16512       leaky_re_lu_16[0][0]             
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 64, 64, 128)  512         conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 128, 128, 4)  132         leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)      (None, 64, 64, 128)  0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 128, 128, 4)  16          conv2d_6[0][0]                   
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, 128, 128, 128 0           leaky_re_lu_17[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 128, 128, 4)  0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 128, 128, 132 0           lambda_2[0][0]                   
                                                                 leaky_re_lu_6[0][0]              
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 128, 128, 132 528         concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 128, 128, 64) 76096       batch_normalization_20[0][0]     
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 128, 128, 64) 256         conv2d_18[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_18 (LeakyReLU)      (None, 128, 128, 64) 0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 128, 128, 64) 4160        leaky_re_lu_18[0][0]             
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 128, 128, 64) 256         conv2d_19[0][0]                  
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 256, 256, 4)  68          leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_19 (LeakyReLU)      (None, 128, 128, 64) 0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 256, 256, 4)  16          conv2d_3[0][0]                   
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, 256, 256, 64) 0           leaky_re_lu_19[0][0]             
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 256, 256, 4)  0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 256, 256, 68) 0           lambda_3[0][0]                   
                                                                 leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 256, 256, 68) 272         concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 256, 256, 32) 19616       batch_normalization_23[0][0]     
__________________________________________________________________________________________________
batch_normalization_24 (BatchNo (None, 256, 256, 32) 128         conv2d_20[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_20 (LeakyReLU)      (None, 256, 256, 32) 0           batch_normalization_24[0][0]     
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 256, 256, 32) 1056        leaky_re_lu_20[0][0]             
__________________________________________________________________________________________________
batch_normalization_25 (BatchNo (None, 256, 256, 32) 128         conv2d_21[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_21 (LeakyReLU)      (None, 256, 256, 32) 0           batch_normalization_25[0][0]     
__________________________________________________________________________________________________
lambda_4 (Lambda)               (None, 512, 512, 32) 0           leaky_re_lu_21[0][0]             
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 512, 512, 3)  99          lambda_4[0][0]                   
==================================================================================================
Total params: 595,795
Trainable params: 592,723
Non-trainable params: 3,072